using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Linq;
using System.Net;
using System.Numerics;
using System.Runtime.InteropServices;
using System.Text;

using Lawrence.Game;

namespace Lawrence.Core;

public enum MPPacketType : ushort
{
    MP_PACKET_CONNECT = 1,      // Not used
    MP_PACKET_SYN = 2,
    MP_PACKET_SYN_LE = 512,  // Little endian clients will send this as their first packet when we default parse as big endian
    MP_PACKET_ACK = 3,
    MP_PACKET_MOBY_UPDATE = 4,
    MP_PACKET_MOBY_EXTENDED = 18,
    MP_PACKET_IDKU = 5,
    MP_PACKET_MOBY_CREATE = 6,
    MP_PACKET_DISCONNECTED = 7,
    MP_PACKET_MOBY_DELETE = 8,
    MP_PACKET_MOBY_COLLISION = 9,
    MP_PACKET_SET_STATE = 10,
    MP_PACKET_SET_HUD_TEXT = 11,
    MP_PACKET_QUERY_GAME_SERVERS = 12,
    MP_PACKET_CONTROLLER_INPUT = 13,
    MP_PACKET_TIME_SYNC = 14,
    MP_PACKET_PLAYER_RESPAWNED = 15,
    MP_PACKET_REGISTER_SERVER = 16,
    MP_PACKET_TOAST_MESSAGE = 17,
    MP_PACKET_ERROR_MESSAGE = 21,
    MP_PACKET_REGISTER_HYBRID_MOBY = 22,
    MP_PACKET_MONITORED_VALUE_CHANGED = 23,
    MP_PACKET_CHANGE_MOBY_VALUE = 24,
    MP_PACKET_LEVEL_FLAG_CHANGED = 25,
}

public enum MPStateType : uint
{
    MP_STATE_TYPE_DAMAGE = 1,
    MP_STATE_TYPE_PLAYER =  2,
    MP_STATE_TYPE_POSITION = 3,
    MP_STATE_TYPE_PLANET = 4,
    MP_STATE_TYPE_GAME = 5,
    MP_STATE_TYPE_ITEM = 6,
    MP_STATE_TYPE_SET_RESPAWN = 7,
    MP_STATE_TYPE_COLLECTED_GOLD_BOLT = 8,
    MP_STATE_TYPE_BLOCK_GOLD_BOLT = 9,
    MP_STATE_TYPE_PLAYER_INPUT = 10,
    MP_STATE_TYPE_ARBITRARY = 11,
    MP_STATE_TYPE_UNLOCK_ITEM = 12,
    MP_STATE_TYPE_GIVE_BOLTS = 13,
    MP_STATE_TYPE_UNLOCK_LEVEL = 14,
    MP_STATE_TYPE_LEVEL_FLAG = 15,
}

public enum MPPacketFlags : ushort
{
    MP_PACKET_FLAG_RPC = 0x1
}

[Flags]
public enum MPMobyFlags : ushort
{
    MP_MOBY_FLAG_ACTIVE = 0x1,
    MP_MOBY_NO_COLLISION = 0x2,
    MP_MOBY_FLAG_ORIG_UDPATE_FUNC = 0x4,
}

public enum MPControllerInputFlags : ushort
{
    MP_CONTROLLER_FLAGS_PRESSED = 0x1,
    MP_CONTROLLER_FLAGS_HELD = 0x2,
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketHeader
{
    public MPPacketType ptype;
    public MPPacketFlags flags;
    public UInt32 size;
    public long timeSent;
    public byte requiresAck;
    public byte ackCycle;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketConnect : MPPacket {
    public Int32 userid;
    public UInt32 version;
    public byte passcode1;
    public byte passcode2;
    public byte passcode3;
    public byte passcode4;
    public byte passcode5;
    public byte passcode6;
    public byte passcode7;
    public byte passcode8;
    public UInt16 nickLength;

    public string GetUsername(byte[] packetBody) {
        byte[] usernameBytes = packetBody.Skip(Marshal.SizeOf(this)).ToArray();
        
        return Encoding.ASCII.GetString(usernameBytes);
    }
}

public enum MPPacketConnectResponseStatus : Int32 {
    ERROR_UNKNOWN = 0,
    SUCCESS = 1,
    ERROR_USER_ALREADY_CONNECTED = 2,
    ERROR_NOT_ALLOWED = 3,
    ERROR_OUTDATED = 4,
    ERROR_WRONG_PASSCODE = 5
}

public interface MPPacket {
    public long GetSize() {
        return Marshal.SizeOf(this);
    }

    public byte[] GetBytes(Packet.Endianness endianness) {
        return Packet.MPStructToBytes(this, endianness);
    }

    public sealed MPPacket Get() {
        return this;
    }
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketConnectResponse: MPPacket {
    public MPPacketConnectResponseStatus status;
}

[StructLayout(LayoutKind.Explicit)]
public struct MPPacketMobyUpdate : MPPacket
{
    [FieldOffset(0x0)] public ushort uuid;
    [FieldOffset(0x2)] public ushort parent;
    [FieldOffset(0x4)] public MPMobyFlags mpFlags;
    [FieldOffset(0x6)] public ushort oClass;
    [FieldOffset(0x8)] public ushort level;
    [FieldOffset(0xa)] public Int32 animationID;
    [FieldOffset(0xe)] public Int32 animationDuration;
    [FieldOffset(0x12)] public float x;
    [FieldOffset(0x16)] public float y;
    [FieldOffset(0x1a)] public float z;
    [FieldOffset(0x1e)] public float rotX;
    [FieldOffset(0x22)] public float rotY;
    [FieldOffset(0x26)] public float rotZ;
    [FieldOffset(0x2a)] public float scale;
    [FieldOffset(0x2e)] public byte alpha;
    [FieldOffset(0x2f)] public sbyte padding;
    [FieldOffset(0x30)] public ushort modeBits;
    [FieldOffset(0x32)] public ushort state;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketMobyExtended : MPPacket {
    public UInt16 uuid;
    public UInt16 numValues;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketMobyExtendedPayload : MPPacket {
    public UInt16 offset;
    public UInt32 value;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketMobyCreate : MPPacket
{
    public UInt32 uuid;
    public UInt32 flags;
}

[StructLayout(LayoutKind.Explicit)]
public struct MPPacketMobyCollision : MPPacket
{
    [FieldOffset(0x0)] public uint flags;
    [FieldOffset(0x4)] public ushort uuid;
    [FieldOffset(0x6)] public ushort collidedWith;
    [FieldOffset(0x8)] public float x;
    [FieldOffset(0xc)] public float y;
    [FieldOffset(0x10)] public float z;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketSetState : MPPacket
{
    public MPStateType stateType;
    public uint offset;
    public uint value;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketSetStateFloat : MPPacket
{
    public MPStateType stateType;
    public uint offset;
    public float value;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketBolts : MPPacket
{
    public MPStateType stateType;
    public uint value;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketSetHUDText : MPPacket
{
    public ushort id;
    public ushort x;
    public ushort y;
    public ushort flags;
    public uint color;
    public ushort box_height;
    public ushort box_width;
    public float size;
}

[StructLayout(LayoutKind.Explicit)]
public struct MPPacketQueryResponseServer : MPPacket
{
    [FieldOffset(0x0)] public uint ip;
    [FieldOffset(0x4)] public ushort port;
    [FieldOffset(0x6)] public ushort maxPlayers;
    [FieldOffset(0x8)] public ushort playerCount;
    [FieldOffset(0xa)] public ushort nameLength;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketErrorMessage : MPPacket {
    public UInt16 messageLength;
}

[StructLayout(LayoutKind.Sequential)]
public struct MPPacketRegisterServer : MPPacket {
    public uint ip;
    public ushort port;
    public ushort maxPlayers;
    public ushort playerCount;
    public ushort nameLength;
    
    public string GetName(byte[] packetBody) {
        byte[] nameBytes = packetBody.Skip(Marshal.SizeOf(this)).ToArray();
        
        return Encoding.UTF8.GetString(nameBytes);
    }
}

[StructLayout(LayoutKind.Explicit)]
public struct MPPacketControllerInput : MPPacket
{
    [FieldOffset(0x0)] public ushort input;
    [FieldOffset(0x2)] public MPControllerInputFlags flags;
}

[StructLayout(LayoutKind.Sequential, Pack =  1)]
public struct MPPacketTimeResponse : MPPacket {
    public ulong clientSendTime;
    public ulong serverSendTime;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketToastMessage : MPPacket {
    public UInt32 messageType;
    public UInt32 duration;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketRegisterHybridMoby : MPPacket {
    public ushort mobyUid;
    public ushort nMonitoredAttributes;
    public ushort nMonitoredPVars;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketMonitorValue : MPPacket {
    public ushort offset;
    public ushort size;
}

[StructLayout(LayoutKind.Sequential, Pack = 1)]
public struct MPPacketMonitoredValueChanged : MPPacket {
    public ushort uid;
    public ushort offset;
    public byte flags;
    public byte size;
    public uint oldValue;
    public uint newValue;
}

